DROP TABLE IF EXISTS `school`;
CREATE TABLE `school`
(
    `id`   BIGINT NOT NULL AUTO_INCREMENT,
    `name` VARCHAR(100),
    PRIMARY KEY (`id`)
);

INSERT INTO `school` (name)
VALUES ('고려대학교'),
       ('연세대학교'),
       ('가톨릭대학교'),
       ('건국대학교'),
       ('경기대학교'),
       ('경희대학교'),
       ('광운대학교'),
       ('국민대학교'),
       ('동국대학교'),
       ('명지대학교'),
       ('상명대학교'),
       ('서강대학교'),
       ('서경대학교'),
       ('서울과학기술대학교'),
       ('서울시립대학교'),
       ('성균관대학교'),
       ('세종대학교'),
       ('숭실대학교'),
       ('중앙대학교'),
       ('한성대학교'),
       ('한양대학교'),
       ('홍익대학교'),
       ('부산대학교'),
       ('충남대학교'),
       ('KAIST'),
       ('UNIST'),
       ('GIST'),
       ('성신여자대학교'),
       ('숙명여자대학교'),
       ('인하대학교'),
       ('이화여자대학교'),
       ('아주대학교')